rails/employee_crud/app/controllers/employee_controller.rb

  def emp_home
    puts "Params Value = #{params}"
    emp_name = params[:emp_name]
    puts "Employee NAME = #{emp_name}"
    puts "Value = #{emp_name.nil?}"
    @employee = nil
    if emp_name.nil?
      @employees = Employee.all
    else
      @employees = Employee.where(emp_name: emp_name)
    end
    @employee = @employees.first
---
SELECT "employees".* FROM "employees" ORDER BY "employees"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."emp_name" = $1 LIMIT $2  [["emp_name", "pooja"], ["LIMIT", 1]]

  def employee_add
    puts "============================="
    puts "Params = #{params}"
    emp = params[:employee]
    puts "Employe = #{emp}"
    puts "Required = #{params.require(:employee)}"
    permitted = params.require(:employee).permit(:emp_name,:email_id,:mobile_no,:address,:salary)
    if permitted.permitted?
      emp = Employee.create(emp_name:permitted[:emp_name],email_id:permitted[:email_id],mobile_no:permitted[:mobile_no],
      address:permitted[:address],salary:permitted[:salary]).valid?
---
INSERT INTO "employees" ("emp_name", "email_id", "mobile_no", "address", "salary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def employee_search
    puts "Params = #{params}"
    name = params.require(:employee).permit(:emp_name)
    puts "Name = #{name}"
    @employee = Employee.where(emp_name: name[:emp_name]);
    puts "NAME = #{@employee}"
    puts "emp = #{@employee}"
    puts "emp size = #{@employee.size}"
---
SELECT "employees".* FROM "employees" WHERE "employees"."emp_name" = $1  [["emp_name", "vicky"]]
SELECT COUNT(*) FROM "employees" WHERE "employees"."emp_name" = $1  [["emp_name", "vicky"]]

  def employee_edit
    id = params.require(:id)
    @emp = Employee.find_by(id: id);
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def employee_delete
    puts "DELETE = #{params}"
    id = params.require(:id)
    puts "ID = #{id}"
    status = Employee.destroy_by(id: id)
---
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 7]]

  def employee_update
    puts "Employee Update"
    puts "params = #{params}"
    permitted = params.require(:employee).permit(:id,:emp_name,:email_id,:mobile_no,:address,:salary)
    id = permitted[:id]
    #puts "emp_id = #{emp_id}"
    emp = Employee.find_by(id: id);
    emp[:email_id] = permitted[:email_id]
    emp[:address] = permitted[:address]
    emp[:salary] = permitted[:salary]
    emp[:mobile_no] = permitted[:mobile_no]
    if emp.save
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "employees" SET "mobile_no" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["mobile_no", 9789347567], ["updated_at", "2021-06-16 12:13:29.870949"], ["id", 6]]